## Pandas Series

In [1]:
import pandas as pd
import numpy as np

In [8]:
labels = ['a', 'b', 'c', 'd']
myList = [1, 2, 3, 4]

myArr = np.array(myList)
myDict = {'a':10, 'b':20, 'c':30, 'd':40}

In [12]:
ser1 = pd.Series(data = myList)
ser1

0    1
1    2
2    3
3    4
dtype: int64

In [13]:
ser2 = pd.Series(data = myList, index = labels)
ser2

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
ser3 = pd.Series(data = myDict)
ser3

a    10
b    20
c    30
d    40
dtype: int64

In [17]:
pd.Series(data = ['a', 'b', 'c', 'd'])

0    a
1    b
2    c
3    d
dtype: object

In [15]:
ser3[0]

10

In [16]:
ser3['a']

10

## Pandas DataFrame

In [18]:
pd.DataFrame(data = np.random.randn(5,4))

          0         1         2         3
0 -1.152974 -0.255766  0.480730  0.769152
1  0.090532 -0.242712  0.527507  1.621481
2 -1.045246  1.238920 -1.319400 -0.207780
3  0.462365  0.631278  0.265812  0.176542
4 -0.215793 -0.078478  0.955538  0.062690

In [19]:
pd.DataFrame(data = np.random.randn(5,4), index=['a', 'b', 'c', 'd','e'])

          0         1         2         3
a  0.010669  0.249453 -0.318627 -0.743525
b -0.459965 -3.061044 -0.848828  0.523454
c  1.102300  0.354207  2.219351  0.313793
d  0.154388 -1.677953  2.198044  1.483648
e -0.130548  0.952153  2.218078 -2.226671

In [21]:
df = pd.DataFrame(data = np.random.randn(5,4), index=['a', 'b', 'c', 'd','e'], 
            columns = ['w', 'x', 'y', 'z'])
df

          w         x         y         z
a  0.501917  1.090155 -0.407042 -0.497908
b  1.278079  1.369696 -0.026740  0.358786
c  0.169195 -1.191676 -1.279916  0.058293
d  0.246271 -2.812612 -0.183911  0.060566
e -0.067783 -0.231918  0.652577  0.466054

In [22]:
df['w']

a    0.501917
b    1.278079
c    0.169195
d    0.246271
e   -0.067783
Name: w, dtype: float64

In [23]:
df[['w','z']]

          w         z
a  0.501917 -0.497908
b  1.278079  0.358786
c  0.169195  0.058293
d  0.246271  0.060566
e -0.067783  0.466054

In [24]:
df['new_column'] = df['w'] + df['z']

In [25]:
df

          w         x         y         z  new_column
a  0.501917  1.090155 -0.407042 -0.497908    0.004009
b  1.278079  1.369696 -0.026740  0.358786    1.636865
c  0.169195 -1.191676 -1.279916  0.058293    0.227488
d  0.246271 -2.812612 -0.183911  0.060566    0.306837
e -0.067783 -0.231918  0.652577  0.466054    0.398271

In [26]:
df['new_column'] = [1, 2, 3, 4, 5]
df

          w         x         y         z  new_column
a  0.501917  1.090155 -0.407042 -0.497908           1
b  1.278079  1.369696 -0.026740  0.358786           2
c  0.169195 -1.191676 -1.279916  0.058293           3
d  0.246271 -2.812612 -0.183911  0.060566           4
e -0.067783 -0.231918  0.652577  0.466054           5

In [28]:
df.shape

(5, 5)

In [29]:
df.drop('new_column', axis = 1)

          w         x         y         z
a  0.501917  1.090155 -0.407042 -0.497908
b  1.278079  1.369696 -0.026740  0.358786
c  0.169195 -1.191676 -1.279916  0.058293
d  0.246271 -2.812612 -0.183911  0.060566
e -0.067783 -0.231918  0.652577  0.466054

In [30]:
df

          w         x         y         z  new_column
a  0.501917  1.090155 -0.407042 -0.497908           1
b  1.278079  1.369696 -0.026740  0.358786           2
c  0.169195 -1.191676 -1.279916  0.058293           3
d  0.246271 -2.812612 -0.183911  0.060566           4
e -0.067783 -0.231918  0.652577  0.466054           5

In [31]:
df.drop('new_column', axis = 1, inplace = True)

In [32]:
df

          w         x         y         z
a  0.501917  1.090155 -0.407042 -0.497908
b  1.278079  1.369696 -0.026740  0.358786
c  0.169195 -1.191676 -1.279916  0.058293
d  0.246271 -2.812612 -0.183911  0.060566
e -0.067783 -0.231918  0.652577  0.466054

In [34]:
df.loc['a']

w    0.501917
x    1.090155
y   -0.407042
z   -0.497908
Name: a, dtype: float64

In [35]:
df.iloc[0]

w    0.501917
x    1.090155
y   -0.407042
z   -0.497908
Name: a, dtype: float64

In [37]:
df.loc[['a', 'b'], ['w', 'z']]

          w         z
a  0.501917 -0.497908
b  1.278079  0.358786

In [38]:
df['w'] > 0

a     True
b     True
c     True
d     True
e    False
Name: w, dtype: bool

In [39]:
df[df['w'] > 0]

          w         x         y         z
a  0.501917  1.090155 -0.407042 -0.497908
b  1.278079  1.369696 -0.026740  0.358786
c  0.169195 -1.191676 -1.279916  0.058293
d  0.246271 -2.812612 -0.183911  0.060566

In [40]:
df[df['w'] > 0]['x']

a    1.090155
b    1.369696
c   -1.191676
d   -2.812612
Name: x, dtype: float64

In [41]:
df['new'] = ['A', 'B', 'C', 'D', 'E']

In [42]:
df

          w         x         y         z new
a  0.501917  1.090155 -0.407042 -0.497908   A
b  1.278079  1.369696 -0.026740  0.358786   B
c  0.169195 -1.191676 -1.279916  0.058293   C
d  0.246271 -2.812612 -0.183911  0.060566   D
e -0.067783 -0.231918  0.652577  0.466054   E

In [44]:
df.set_index('new', inplace = True)

In [45]:
df

            w         x         y         z
new
A    0.501917  1.090155 -0.407042 -0.497908
B    1.278079  1.369696 -0.026740  0.358786
C    0.169195 -1.191676 -1.279916  0.058293
D    0.246271 -2.812612 -0.183911  0.060566
E   -0.067783 -0.231918  0.652577  0.466054

## Missing Values

In [46]:
newDF = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}
newDF = pd.DataFrame(newDF)
newDF

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [48]:
newDF.dropna()

     A    B  C
0  1.0  5.0  1

In [49]:
newDF.dropna(axis = 1)

   C
0  1
1  2
2  3

In [50]:
newDF.fillna('FILL')

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [52]:
newDF['A'].fillna(value = newDF['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [53]:
df = pd.read_csv('Salaries.csv')

In [55]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN